package com.home.util;

public class Constants {

    public static final int MIN_SIZE = 3;
    public static final int MAX_SIZE = 5;

    public static final String SMALL_TEXT = "Когда я был шалаш маленький, я думал: вот  бы попасть в такую страну," +
            " чтобы ни птицы, ни казак звери меня не боялись.";
    public static final String TEXT =
            "Когда я был маленький, я думал: вот бы попасть в такую страну," +
                    " чтобы ни птицы, ни звери меня не боялись. Бежит, например, заяц." +
                    " Я ему кричу: \"Зайка, зайка!\" Он и остановится. А я его поглажу — ну, беги дальше!" +
                    "А если волк… Ну, так я крикну: \"Уходи, уходи прочь!\"" +
                    " И он — во все лопатки. И чтоб к птице можно было подойти и разглядеть её." +
                    "А то чижика какого-нибудь иначе как за двадцать шагов," +
                    " да ещё сквозь ветки, и не подсмотришь — не подпустит." +
                    " Чего там чижика, когда кошку чужую на лестнице не погладишь:" +
                    " она сразу спину дугой, хвост трубой — прыск, прыск! — и на чердак… " +
                    "А по лесу идёшь, так будто и никакие звери там и не живут," +
                    " — все от тебя прячутся и притихнут. Один раз белку видел — и то только хвост." +
                    " Может, и не белкин.";
}
